Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t
Struct for a tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t.Id
ID of the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t.SubId
SubID of the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t.ObjectType
Object type of the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t.HitPoint
Location (hit point) of the tolerated object.